Revit 2027 API
ConnectionValidationWarning.GetParts Method
 Get ElementIds of affected parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetParts()
Public Function GetParts As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetParts()
member GetParts : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace